app/views/comments/_comment.html.erb

INSERT INTO "comments" ("user_id", "body", "rating", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["body", "try this"], ["rating", 2], ["product_id", 5], ["created_at", "2017-06-06 14:19:30.983555"], ["updated_at", "2017-06-06 14:19:30.983555"]]
---
    <div class="row form-group">
      <input class="form-control" type="text" placeholder="<%= comment.user_first_name %> commented <%= "#{time_ago_in_words(comment.created_at)} ago" %>" readonly>