app/controllers/comments_controller.rb

  def create
    @user = current_user
    @product = Product.find(params[:product_id])
    @comment = @product.comments.new(comment_params)
    @comment.user = current_user
    respond_to do |format|
      if @comment.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "body", "rating", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["body", "Rad Bike"], ["rating", 5], ["product_id", 1], ["created_at", "2017-05-29 02:38:04.813099"], ["updated_at", "2017-05-29 02:38:04.813099"]]

  def destroy
    @comment = Comment.find(params[:id])
    product = @comment.product
    @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]