app/controllers/payments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "product_id", "total") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["product_id", 1], ["total", 999.0]]
---
  def create
    @product = Product.find(params[:product_id])
    @user = current_user
    token = params[:stripeToken]
    # Create the charge on Stripe's servers - this will charge the user's card
    begin
      charge = Stripe::Charge.create(
        :source => token,
        :amount => (@product.price * 100).to_i, # amount in cents, again
        :currency => "eur",
        :description => params[:stripeEmail]
      )

    if charge.paid
      Order.create(product_id: @product.id, user_id: @user.id, total: @product.price)