app/controllers/products_controller.rb

  def index
    @products = params[:q].present? ? Product.search(params[:q]) : Product.all
    @products = @products.order("created_at DESC").paginate(:page => params[:page], per_page: 6)
---
SELECT "products".* FROM "products" WHERE (name LIKE '%rim%')
SELECT MAX("products"."updated_at") FROM "products"
SELECT  "products".* FROM "products" WHERE (name like '%Rim%') ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"

  def show
    @comments = @product.comments.order("created_at DESC").paginate(:page => params[:page], per_page: 3)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = $1 ORDER BY created_at DESC LIMIT $2 OFFSET $3  [["product_id", 1], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) AS "size", MAX(subquery_for_cache_key.updated_at) AS timestamp FROM (SELECT  "comments"."updated_at" FROM "comments" WHERE "comments"."product_id" = $1 ORDER BY created_at DESC LIMIT $2 OFFSET $3) subquery_for_cache_key  [["product_id", 5], ["LIMIT", 3], ["OFFSET", 0]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "colour", "price") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Test Pcont"], ["description", ""], ["image_url", ""], ["created_at", 2017-05-12 10:21:24 UTC], ["updated_at", 2017-05-12 10:21:24 UTC], ["colour", "Black"], ["price", 0.67e2]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "image_url" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["image_url", "http://www.roadwarriorbicycles.com/uploads/5/8/0/8/5808109/4234191_orig.jpg"], ["updated_at", "2017-05-16 12:33:15.764377"], ["id", 2]]