app/controllers/static_pages_controller.rb

SELECT  "products".* FROM "products" LIMIT $1  [["LIMIT", 3]]
---
  def landing_page
  	@products = Product.limit(3)