app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "Jay"], ["last_name", "G"], ["updated_at", "2017-05-18 15:04:23.864840"], ["id", 1]]